{"data":{"markdownRemark":{"html":"<p>Hello, my name is Keith, and welcome to yet another about page. Over the years, I've held a wide variety of titles, which really has made them ultimately useless. Previous titles include: Web Developer, Web Architect, Solutions Architect, Hope Consultant, Sales Consultant, and Digital Engineer.</p>\n<h2>Code Played With:</h2>\n<ul>\n<li>JavaScript</li>\n<li>VanillaJS - the #1 JavaScript Framework used by every major internet property</li>\n<li>Angular 2</li>\n<li>Angular 1.x</li>\n<li>jQuery (in its various iterations)</li>\n<li>jQuery UI, because evidently it deserves its own line</li>\n<li>MooTools</li>\n<li>Dojo</li>\n<li>HTML (Yes, XHTML, and HTML5)</li>\n<li>CSS (Yes, CSS 2 and 3)</li>\n<li>Java (which is different than JavaScript, recruiters)</li>\n<li>PHP</li>\n<li>CodeIgniter</li>\n<li>Laravel</li>\n<li>Zend</li>\n<li>WordPress</li>\n<li>Node.JS</li>\n<li>MySQL, MSSQL, MongoDB, Redis, NOSQL, etc. etc.</li>\n<li>.net (both old school ASP.net and newer MVC)</li>\n<li>XML/XSLT</li>\n<li>Ruby</li>\n<li>Gulp</li>\n<li>Grunt</li>\n</ul>\n<br />\n<h4>So, when did you start getting involved with programming ?</h4>\n<p>I would say when I was about 13 years old. At the time I was a part of a gaming community in WoW and my first project involved creating a simple forum in phpBB. I found it very difficult but I enjoyed every second of doing it. Since then, if someone asked me what I wanted to do in life, the answer was always the same. Programming.</p>\n<p>When I was about 18 the term programmer changed into a web developer. Before that I have spent some time learning C# and later Java. But I would always return to HTML, CSS and JavaScript.</p>\n<br />\n<h4>Why front-end ?</h4>\n<p>I tried both back-end and front-end before I made my decision. I found back-end to be much more challenging but not rewarding. </p>\n<p>I have spent time working on something that was very important for the website, but no one would every know. While front-end let me build the actual interface people would interact with.</p>\n<p>It felt so rewarding, it made me feel good.</p>\n<br />\n<h4>How do you plan to move forward with your career ?</h4>\n<p>This is something I am still planing. So far I know two things :</p>\n<ol>\n<li>I want to become an even better developer. </li>\n<li>I want to give back to the community.</li>\n</ol>\n<p>This blog is an idea to help me do both. I will write about the struggles I have along the way and how I solved them. It will be a way for me to always look back and see what I went trough, and I hope, a guide for those that struggle with the same.</p>\n<h4>Special Thanks</h4>\n<p>After working with Gatsby, React, and GraphQL, <a href=\"https://stefanivic.com/\">Stefan Ivić</a> pointed me to his github repo to help me jumpstart my blog!</p>","frontmatter":{"path":"/about","title":"Who, What, When, Where, and Maybe Why"}}},"pageContext":{}}