{"data":{"markdownRemark":{"html":"<p>A huge, huge, HUGE problem with modern technology, blogs, and documentation - is how difficult it is to find out how to do a task, and to make sure that the code you're reading about lines up with the version you're working with.</p>\n<p>It used to be that when you looked up a tutorial, it was almost a given that \"this code is going to work\" - beyond plain JavaScript, the days of Dojo, jQuery, and MooTools (and the others I'm not mentioning). You wanted to do something (say, alpha pngs in Internet Explorer) and the code you'd find would work. They'd at least reference the main documentatin, and the variations usually weren't such major changes.</p>\n<p>Then we got to the level of rapid iterations of our tools. I was working with Angular 2.x at a prior gig, and I was digging into different concepts - nothing necessarilly ground breaking, mind you, just looking up certain behaviors and tutorials to see what could be accomplished from the requests of my User Experience counterparts. But the problem I discovered - a lot of people were trying to \"stay at the top of their game\" or \"establish themselves as 'thought-leaders'\" - so they cranked out a lot of tutorials based on <em>bleeding edge</em> code - so if you were running with <em>that particular version</em> of Angular, you were good to go! Any other version, and you could be out of luck - either unexpected errors, incorrect syntax, or non-existent function calls.</p>\n<p>The better ones would indicate \"this is for RC3\" or \"version 2.x\" - or what I loved - when they'd <em>update</em> their code and either link a newer resource, or updating their code to accomodate for the changes in the code they wrote. Honestly, if you're going to blog about code, that's something you should revisit - \"did I write code? Has it changed? Have I improved upon it? <em>Did I list what exact version and/or associated packages I built with it?</em></p>\n<p>This was kicked off now that I've began this blog written in Gatsby. Trying to extend it and tweak it, I've come across blog entries touting \"how-to!\" <a href=\"http://stayregular.net/blog/adding-images-and-media-to-your-gatsbyjs-blog\">Just like this blog I used for a reference</a> - it has comments from <em>two months ago</em> and it's already not in-line with more recent versions of Gatsby (the danger of bleeding edge tech, eh?)</p>\n<p>A lot of that article remained <em>mostly</em> correct. </p>","timeToRead":2,"frontmatter":{"path":"/gatsby-blog-image","title":"Gatsby Images - adding to your blog","date":"17th February, 2019.","category":"Code"}}},"pageContext":{}}